{"data":[{"id":"1542971650123128834","text":"RT @jfmclooney: Can’t wait to see “42.37% chance Peterson’s wife goes into labor” pop up in the corner of my screen tonight and then change…"},{"id":"1542937835912794113","text":"RT @CespedesBBQ: Got the inside scoop on Max Scherzer’s time as a Rumble Pony.\n\nDude bought the entire team AirPods and dropped thousands o…"},{"id":"1542937544425447425","text":"wut https://t.co/TZASb7XV1F"},{"id":"1542933429334982658","text":"If you think Bobby Bonilla getting $1.2M per year is ridiculous, wait until you see how much the owners have stolen by colluding (on multiple occasions throughout baseball history) https://t.co/ramvISHtlO"},{"id":"1542836102947536898","text":"hell ya brother https://t.co/mEYnJgTH89"},{"id":"1542604104001806336","text":"RT @JaysKid_RHP: \"Billy, this is the Rays pitching staff. Specifically their relief pitchers. They are one of the most undervalued bullpens…"},{"id":"1542599466116603905","text":"RT @Schubes17: @tipping_pitches 27 Crown Jewels bro"},{"id":"1542591794390749184","text":"@diogojira I believed you!!"},{"id":"1542591138368032777","text":"cheeky lil “lost service for an hour” reply tweet"},{"id":"1542590655725281281","text":"you name an empire and British people are gonna stan"},{"id":"1542590188429275136","text":"@ViewsFrom314ft https://t.co/HExe2nuV85"},{"id":"1542589786682179591","text":"@sung_minkim no but I would love to go!!!"},{"id":"1542582195809710080","text":"@epouvantail just got in yesterday!"},{"id":"1542582085713465344","text":"@okaygreatfine it makes you really question the citizens of the world"},{"id":"1542579580266893312","text":"the amount of Y*knees hats you see in London makes me sick"},{"id":"1542550268885303297","text":"so true bestie https://t.co/MSClk6XCYC"},{"id":"1542550124928319488","text":"RT @JoshHejka: Can confirm. Ate well."},{"id":"1542490631905447937","text":"the guy who says Delicate…it’s called TASTE"},{"id":"1542490360135434242","text":"coming here to announce my Reading Fightin Phils fandom https://t.co/EA40OQZmw0"},{"id":"1542468133960781825","text":"people are having a Completely Normal One reacting to this https://t.co/Gv6VzH8G3y"},{"id":"1542433980301119488","text":"I know another guy who could take care of the postgame spread every night https://t.co/5XWeppqUUA"},{"id":"1542409395081908224","text":"@itsjonnysd This is…not a serious take about Mike Clevinger. It is a joke. A bit, if you will."},{"id":"1542400080778366976","text":"To all the people asking if this is real: absolutely. He adds two hours to every game he starts. They’re powerless to stop him."},{"id":"1542314079687016448","text":"@joeygrundl Thank god, my mission of slandering him is complete"},{"id":"1542307640142925824","text":"RT @KenRosenthot: my dog gearing up to do a poop"},{"id":"1542307187497631745","text":"@joeygrundl It mostly is lol"},{"id":"1542306954059476992","text":"@byoungblood27 😶"},{"id":"1542305679876030464","text":"Look, I’ve never cared that much about pace of play, but Mike Clevinger simply must be stopped https://t.co/WTtAoS00Qr"},{"id":"1542301723452227584","text":"@BattinAround wonderful. I have never been more mad at you all in my life. we may never recover from this"},{"id":"1542300723001675782","text":"@BattinAround what are we beefing about this time? happy to do it, just need a quick briefing"},{"id":"1542219535297552384","text":"I’m good with KatyPerrysBootyHole and wetbutt23 https://t.co/SUZRM91e4m"},{"id":"1542152833100914689","text":"@jenmacramos we’re trying Jen"},{"id":"1542151952963964931","text":"The last part of this tweet is so important. You can’t just start Manfred’s “legacy” when he became commissioner. It’d be like if Reagan’s VP became president and didn’t wanna talk about any of the problems trickle down economics caused. Oh wait— https://t.co/XysGorg5Hw"},{"id":"1542140693195493378","text":"@tarantuladad finally, people realize"},{"id":"1542132270030589952","text":"RT @CespedesBBQ: raise a damn banner for this one @Rockies"},{"id":"1542132148563591168","text":"I gotta update my mental shorthand here…our FIVE YEAR anniversary is coming up in a month 😮😮😮"},{"id":"1542131431601836032","text":"that’s weird…we have four years worth podcasts acknowledging a litany of things wrong with baseball, and I don’t often see people accusing us of hating the game 🤷‍♂️ https://t.co/R8Uwd9av2f"},{"id":"1542124600343121923","text":"Rob Manfred, please feel free to go [redacted] https://t.co/AvUtBE1a0A"},{"id":"1542116921121951745","text":"Elvis Peguero (a guy I’ve definitely heard of)…COME ON DOWN! https://t.co/zVYSOTIxNI"},{"id":"1542096020481445889","text":"https://t.co/MwkIFWDLV3"},{"id":"1541960057939689474","text":"my \"I'm a Dodger for the next six years and that's where my focus lies…I’m happy to be a Dodger\" shirt has people asking a lot of questions already answered by my shirt https://t.co/TRhPigkv44"},{"id":"1541949786093494273","text":"it's gonna come out at our usual time next Monday because I'm going to London and we weren't gonna be able to record a normal episode. rest assured, this is a very, very detailed episode to hold everyone over :)"},{"id":"1541949448217104384","text":"recorded an episode of the tipping pitches podcast about this https://t.co/mYkqMJEsAP"},{"id":"1541852518501720065","text":"RT @cdgoldstein: the five-year plan to post a winning calendar month is right on time"},{"id":"1541851094753615872","text":"@BekahAnsbro evolve or die"},{"id":"1541846745780572161","text":"gonna do an episode of the Tipping Pitches podcast about this https://t.co/JaFr9lTYom"},{"id":"1541832943215251458","text":"Freddie Freeman knows that deep down in place he doesn’t talk about at parties…\n\nFreddie Freeman wants me on that wall. \n\nFreddie Freeman needs me on that wall. https://t.co/0q2ZRseLGD"},{"id":"1541808114726408192","text":"Overturning a century-old aberrational antitrust ruling ? https://t.co/BESn2yl97H"},{"id":"1541799862399901696","text":"RT @okaygreatfine: @EvanDrellich @tipping_pitches we did it joe"},{"id":"1541799715448279043","text":"https://t.co/xJx2bM0hPp https://t.co/JaFr9lTYom"},{"id":"1541614200421842946","text":"@scottmkorb I thought this week's was even better, but maybe that's the lack of caffeine speaking :)"},{"id":"1541612254642282497","text":"@scottmkorb last week's meaning today or last week's meaning RIP to your revenue sharing check?"},{"id":"1541590057580126208","text":"when I told people that they should consider rooting for the Royals, it was really just a long con to support my paisan brother https://t.co/OUHyzXDW69"},{"id":"1541587906090901510","text":"@ThatSportsGamer the article is insane for so many reasons!"},{"id":"1541587801640255488","text":"you can't be throwing those on the field. there are records that need to be set https://t.co/HE0yH5kZMB"},{"id":"1541486494841462784","text":"I shake my head earnestly and say he should've slapped a single the other way https://t.co/2iPChXqhhF"},{"id":"1541445423113592832","text":"you can listen to this Incredibly Normal, Nothing To See Here, Definitely Am Not Going Through Caffeine Withdrawals episode of tipping pitches wherever you get your podcasts:\n\nhttps://t.co/BWQrIWc7kT"},{"id":"1541445236198711297","text":"In this ep:\n\n-covid making coffee taste like dirt\n-the script Starbucks employees had to follow if they were asked about Howard Schutlz's presidential campaign\n-two appropriate times to do the wave\n-baseball (?)\n\nApple: https://t.co/SuIVVTSoE6\nSpotify: https://t.co/ofrmLYXEjI"},{"id":"1541282650488557568","text":"RT @rodger: the Stanley Cup trophy ceremony is the best trophy ceremony because they give the trophy to the players instead of the owner, b…"},{"id":"1541274881110822913","text":"*team goes on a five game skid*\n\n\"mostly, I'd like to apologize to the women and children. they've been through enough. they don't deserve to see us playing shit baseball out there\""},{"id":"1541274598435594241","text":"It's sending me that Jesse Winker apologized to \"the women and children\" like he's the captain of The Titanic apologizing for not having enough lifeboats to get them off board https://t.co/YRfrLmxfT5"},{"id":"1541179228380712962","text":"hello friends — any questions for a mailbag? we’re recording later this evening"},{"id":"1541165165151850496","text":"When there’s only ranch seeds left https://t.co/H4ry2iIDHu"},{"id":"1540488806998179841","text":"inBuck zero https://t.co/F7nfJvGeJe"},{"id":"1540104076309868545","text":"RT @JackCurryYES: I know little about Harry Styles, but the “As It Was” song playing at the Stadium right now is very listenable."},{"id":"1540101410691227648","text":"cc @UnfortunateMLB https://t.co/tZ87HcX6Dx https://t.co/JpmiFY0umf"},{"id":"1540067292842668032","text":"Tag yourself, I'm the duckling hoping the pitcher throws the right thing"},{"id":"1540067046838247424","text":"Just browsing through some extremely normal stock baseball photos today https://t.co/G2Rtr3N3Am"},{"id":"1540059668269113348","text":"yeah, i have havana syndrome. havana hard time buying the mets, so i had to go buy the minnesota timberwolves and pretend like i know what a basketball is"},{"id":"1540023943712718848","text":"he must be really fired up to hear about the nicotine ban. saving baseball just got so much easier https://t.co/R0byEJmvJv"},{"id":"1539968170584203282","text":"RT @MarinerMuse: ATTENTION MARINERS FANS:\n\nWe’re getting numerous reports of T-Mobile Park game employees NOT getting the tips the Point of…"},{"id":"1539804288792272897","text":"@BekahAnsbro famously we always meet all these requirements"},{"id":"1539799670452543490","text":"@thejjar what the hell"},{"id":"1539789788869529607","text":"please, consider your impact"},{"id":"1539789652995067906","text":"I can't believe people are just logging and thinking, \"Yes, I will share this photo of Kyle Farnsworth far and wide\""},{"id":"1539784385968365570","text":"rad shirt, IMO https://t.co/VM48mq2PSc"},{"id":"1539765450757885953","text":"me watching Patrick Corbin be total dog shit on the mound: https://t.co/b3M5dHmaQR"},{"id":"1539764984225435649","text":"I would say Patrick Corbin retire bitch, but it’s way more fun to watch him put up a 7 ERA on the worst team in baseball"},{"id":"1539740216835162114","text":"you’re laughing? Liberty Media is about to become the 13th largest bankruptcy case in U.S. history, and you’re laughing? https://t.co/75JTSievK5"},{"id":"1539625010393931776","text":"no one:\n\nKEITH OLBERMANN: Actually, Tungsten Arm O’Doyle was clearly only the third best player on that ‘21 Akron Groomsmen squad. To suggest that mirroring his accomplishments is anything to be particularly proud of is an admission that you are simply not a baseball historian"},{"id":"1539600241812553728","text":"RT @Shauncore: That tweet was not a joke https://t.co/DCBtzJHpqf"},{"id":"1539426295452471296","text":"RT @RichardStaff: The best part about minor league rehab assignments is seeing guys who’ve made $200M play for a team named the Sod Poodles…"},{"id":"1539406261824929792","text":"Cursed score https://t.co/AsnRde0FQn"},{"id":"1539350528248930304","text":"I am so tired of hearing about the baseball! So tired!"},{"id":"1539350427233357824","text":"https://t.co/eg2M6byQQ4 https://t.co/elWHTWdy3a"},{"id":"1539344638947086337","text":"we’ve never had a catcher on the show, so no. easy question https://t.co/34VSHUNJwi"},{"id":"1539338542182187008","text":"he’s a 10 but he had to settle a racketeering case with his brother-in-law for an undisclosed amount of money 😔"},{"id":"1539338375672606720","text":"he’s a 10 but thinks it’s better to be leading by an even number of runs instead of an odd number of runs"},{"id":"1539289677290684416","text":"go off short king aaron judge"},{"id":"1539289510160343040","text":"this makes aaron judge look shorter than me https://t.co/IoGhY7pqon"},{"id":"1539284972774862850","text":"@alix_rae @ararebit @KWaldenPhD @edrabinski @bookowl @smbrms this thread rules, and if this meetup happens in NYC, please let us know! We’d love to come out if possible!"},{"id":"1539242052516466695","text":"RT @curlyfro: well now it’s definitely dead."},{"id":"1539081033416597504","text":"https://t.co/ZFPQJ3HKgB"},{"id":"1539080602317639682","text":"More like tallstop am I right *ducks* https://t.co/tS3xMa1UQm"},{"id":"1539061251220938755","text":"me booting up the Zoom knowing I was about to test positive for the novel coronavirus https://t.co/4MmEKwPPhw"},{"id":"1539060844356636673","text":"RT @gordonkatic: New Manfred nonsense dropped, ⁦@tipping_pitches⁩ boys on it.  https://t.co/nbFR07ez3M"},{"id":"1538907075522269187","text":"@RuthKapelus thank you!"},{"id":"1538905947392954371","text":"was this recorded during early onset symptoms caused by the novel coronavirus? only god (and today's positive test) can say\n\nlisten to Tipping Pitches wherever you get podcasts! https://t.co/IRp5wjKuLY"},{"id":"1538905416775630848","text":"Freddie Freeman bad take dramatic reading (!), the A's giving up the game a little too much, and the re-emergence of our Good Friend Rob\n\napple: https://t.co/6vW3cPAhT2\nspotify: https://t.co/QBCnQYIPyb"},{"id":"1538662093033033729","text":"LFGM (let's fuckin' go minor leaguers, get a union) https://t.co/JgdMYXMPMJ"}],"meta":{"result_count":100,"newest_id":"1542971650123128834","oldest_id":"1538662093033033729","next_token":"7140dibdnow9c7btw421thdhflsw1pcxrqm3x1jpdvp6h"}}