{"data":[{"id":"1526211497042509824","text":"no one:\n\nBrandon Nimmo during the 2020 election: https://t.co/hSOsZtzzup"},{"id":"1526047932105080834","text":"you try deciding which All-GIF draft is the best. it's impossible"},{"id":"1526047469179703299","text":"jane, please respect alex rodriguez's need for rest. he has been on a mission to go back and listen to every episode of tipping pitches so he can write a definitive power ranking of them for our patreon newsletter. the man hasn't slept for days https://t.co/5KxNN3NQ6r"},{"id":"1525945295732883458","text":"RT @FoolishBB: imagine thinking you need hits to win a baseball game"},{"id":"1525945247624318977","text":"@RichardStaff @CespedesBBQ no, Rich, they won the Russian Revolution"},{"id":"1525939130533916675","text":"@JakeMHS the problem is we had just spent the last 90 mins talking to each other on tape. needed a damn break!"},{"id":"1525938591519715328","text":"it’s one thing for us both to tweet the same joke from the same account. it’s an entirely different thing when we’re sitting in the same room while we do it https://t.co/emTyrVIP6u"},{"id":"1525938487421194241","text":"I love watching the Cincinnati Reds https://t.co/oVOHeiNf5p"},{"id":"1525933681809969153","text":"Interesting how Phil Castellini isn’t quite as fired up to go on local radio shows to shame fans now. Where ya gonna go? Anywhere to avoid being in the public eye!"},{"id":"1525933388196106240","text":"Where ya gonna go? https://t.co/7FDuqlaQmp"},{"id":"1525894160653361155","text":"one of those ideas where you can so easily imagine the green light in the pitch meeting https://t.co/f0DWkzCpA6"},{"id":"1525877876725321728","text":"the ideal baseball broadcast is one where they don’t talk about the best player https://t.co/7r9WCwEl45"},{"id":"1525873890412711936","text":"https://t.co/nbM5BxQudK https://t.co/5kdxyt831O"},{"id":"1525640021113507840","text":"yesterday when I was leaving the Mets game there was a man in the parking lot with a full drum kit drumming along with a speaker that was blasting All The Small Things. dudes rock, indeed"},{"id":"1525330834798018561","text":"RT @awaitngusrname: the guy who took this photo said he liked our shirts so we told him to listen to the pod @tipping_pitches you’re welcom…"},{"id":"1525330828049408001","text":"@awaitngusrname that’s praxis"},{"id":"1525315082195984386","text":"RT @ShakerSamman: THE TIPPING PITCHES HIVE GROWS @tipping_pitches"},{"id":"1525315065435545600","text":"we’re saying hell yeah, brother https://t.co/rHOUHf3Iw4"},{"id":"1525302367108968448","text":"@chipoffyoblock based"},{"id":"1525301688470585344","text":"RT @colleensullivan: Love the team at @tipping_pitches, will always support. \n\nNot a fan of my tier name 🤪 https://t.co/Fu7LTYK74V"},{"id":"1525301633965596672","text":"the american dream https://t.co/dfE2vy85wG"},{"id":"1525291547809533952","text":"Rob Manfred retire bitch https://t.co/aTZ0zyFrZt"},{"id":"1525290595903803393","text":"genuinely failed society https://t.co/97dqAZNXHc"},{"id":"1525290532670476288","text":"this looks so good 😭😭 https://t.co/trk3lfr3Xz"},{"id":"1525144816421568513","text":"She’s here and she’s beautiful https://t.co/wGDwwdfkMI"},{"id":"1524952874286989321","text":"https://t.co/vcW2WInnk7"},{"id":"1524936803010109440","text":"RT @CespedesBBQ: I guess he didn't throw that home run"},{"id":"1524936507496210457","text":"Sure!! https://t.co/S5SVktl4vO"},{"id":"1524925936298237959","text":"@cara_jeffrey 💞💞"},{"id":"1524925893180792843","text":"RT @cara_jeffrey: unionize the minors!!! https://t.co/easaIJ2r0h"},{"id":"1524860728288616448","text":"@makenna_m19 Gross!!!"},{"id":"1524857441506279436","text":"@makenna_m19 Ah, thankfully I missed it! I should have known"},{"id":"1524856853666185225","text":"Here’s Blake Treinen celebrating Democrats’ failure to safeguard abortion rights through the Senate. My only surprise here is that it took him this long to post something stupid on the matter. https://t.co/AzdDRGKhWu"},{"id":"1524808536596926466","text":"@dhhiggins saw how well means testing was working in the rest of society and they were like “lemme get some of that!”"},{"id":"1524808072572592129","text":"“Listen, I’m just gonna say it: people liking the team I like is bad” https://t.co/hsjgzAf5DA"},{"id":"1524798670578778119","text":"RT @kylebandujo: https://t.co/BX7bSmVNNr"},{"id":"1524780207785267201","text":"RT @batflips_nerds: https://t.co/3s8KhtidH3"},{"id":"1524777740356001798","text":"many pundits are asking the question, few know the answer https://t.co/wZswcy4sSU"},{"id":"1524599735226671105","text":"tipping pitches official outing https://t.co/gZ013kz9hM"},{"id":"1524563561317638145","text":"RT @JATayler: MANFRED: Okay, the balls are too soft and hard to throw\nPLAYERS: That's not good\nMANFRED: And the umpires can't call balls an…"},{"id":"1524531006501490689","text":"@ebrand127 yes a few weeks ago!"},{"id":"1524529879852666882","text":"let’s go Jays https://t.co/bzvhCXQKwD https://t.co/CHRkWv3vTu"},{"id":"1524507205621493762","text":"@2007warpedtour @puptheband We do our best"},{"id":"1524488753087193094","text":"If we were to reach that level of support from this community, we'd want to make sure to repay it with more of what got this all started — a widely available podcast that anyone can listen to for free"},{"id":"1524488751719792643","text":"copying the text below:\n\nAt $5,000 a month, we'll start releasing a second public episode of Tipping Pitches every week. The ultimate goal of this Patreon is to be able to commit more time and resources to Tipping Pitches (continued)"},{"id":"1524485865241731073","text":"some Patreon news that's relevant even if you're not a Patron (remember, you can sign up at https://t.co/zpnrjRC9ev!!) https://t.co/iV3pitGgqn"},{"id":"1524475315573116933","text":"Excited to root for the Blue Jays in New York today*!\n\n*go to the @puptheband show"},{"id":"1524403570640138240","text":"*revealed the exact terms, not \"leaked\" them!"},{"id":"1524403339106164736","text":"@jonkolnoski this is true lol"},{"id":"1524402920007122946","text":"I have no idea whether they'll come to an agreement, and I have no opinion on what contract Aaron Judge should or should not sign, but this is a pretty awful confluence of events if your goal is to keep a healthy relationship with your superstar"},{"id":"1524402688217255950","text":"From a process perspective, this is about as bad as it gets:\n\nFailed to settle arb -&gt; Failed to reach extension before the season -&gt; Leaked the exact terms of the failed extension -&gt; Have to trash him at arb and continue extension negotiations at the same time https://t.co/Sw6tLB5szv"},{"id":"1524394513497796611","text":"revisiting this 🤷‍♂️ https://t.co/jHi0f1kcEm"},{"id":"1524243613248536576","text":"\"Which was the drink that did you in last night?\" https://t.co/Nojeozefcd"},{"id":"1524223740648828931","text":"@jaysonbuford it would’ve leaked either way, but yeah. the deal should’ve gotten done"},{"id":"1524223569089245184","text":"in 2019 I might’ve been able to catch this ball in Yonkers"},{"id":"1524223070227075073","text":"the ball is definitively dead and Aaron Judge still regularly does this 😳 https://t.co/OzzVLSywOA"},{"id":"1524087508044296193","text":"🥵🥵🥵 https://t.co/Ihze6OVHL4"},{"id":"1524087118150176769","text":"there’s nothing prettier than a perfect changeup from that arm slot. Pedro is the gold standard, but Castillo and Devin Williams are the next best thing https://t.co/ee95VifOOi"},{"id":"1524083717630738433","text":"thanks to rob for making our jobs easy https://t.co/bgUEv8y4PJ"},{"id":"1524083642422734851","text":"so, it turns out we made a good choice talking about the baseballs on this week's episode,,,\n\napple: https://t.co/k5mD91ehuX\nspotify: https://t.co/dIkTQnh8L2"},{"id":"1524078929824337920","text":"we think MLB makes it easy for us now? imagine whatever two dummies are doing 2047’s version of Tipping Pitches"},{"id":"1524078381758885889","text":"tweets like this are going to be awesome in the future definitive crypto ponzi scheme documentary https://t.co/OD6UEHk48L"},{"id":"1524066955266826240","text":"RT @RobertStock6: Guardians and Mets ninth inning comebacks is a reminder that you’re extremely sensitive and/or dumb if you get upset when…"},{"id":"1524062723671273474","text":"the owners: https://t.co/YTsuIBX4oA"},{"id":"1524062641165111297","text":"Rob Manfred: *states a goal for the sport*\n\n[the exact opposite happens]\n\nRob Manfred: ah, well, nevertheless"},{"id":"1524060999527145473","text":"Rob Manfred’s tenure as commissioner: https://t.co/uelOOdvoOI https://t.co/bSx5hPYrBO"},{"id":"1524035332592869376","text":"https://t.co/2gnj5ud2wc https://t.co/VGeJP4TTkk"},{"id":"1523879877119721472","text":"Velazquez! Sorry, always screw that up!"},{"id":"1523879327359717377","text":"i- https://t.co/KIrDMEFIuS"},{"id":"1523876387039363072","text":"Trout, Ohtani, Rendon, Velasquez web gems, Syndergaard maybe back? Angels good and fun, I'm afraid"},{"id":"1523874994127880194","text":"@tangible_uno @mkrwrt so show it hurts"},{"id":"1523874716968235010","text":"I am such a sucker for the clairvoyant home run call, that has to be the best feeling in the world as a broadcaster https://t.co/sdHYiVanzR"},{"id":"1523874567260880897","text":"@WhitneyM02 especially since he was such a terrible outfielder that they just shrugged and said \"eh, try first base!\""},{"id":"1523873759417057281","text":"the Naylor scoop is almost more astonishing than what José did"},{"id":"1523872659511156740","text":"@Vance_of_Aurora hell of a play. rest of the game notwithstanding, you have to tip your cap there"},{"id":"1523871651540217860","text":"@TheTyronePalmer I see you, and you are valid"},{"id":"1523871587128291328","text":"@JaneOst_ oops!"},{"id":"1523871510225731587","text":"like what https://t.co/QB6mHW6gbV"},{"id":"1523870885140074498","text":"josé ramírez does not want you to have a normal fan's life"},{"id":"1523866955660283907","text":"I imagine that every day White Sox fans wake up and say \"please let my team be normal.\" And every day, the baseball gods strike that hope down in frankly astonishing ways"},{"id":"1523809412070010880","text":"Rob sneaky tall?! Someone get me some stats on Rob’s height! https://t.co/2kV3GAyKGc"},{"id":"1523710786551808000","text":"We're so appreciative of the people who have signed up, and of the community already going off in the Slack! We're also starting to get the sticker packs for the top two tiers sent out. More news to come on the rest of the perks associated with those $7 and $12 tiers! 💕"},{"id":"1523710784832163841","text":"We've enjoyed doing (almost) every episode of this show, dating all the way back to 2017. If you've enjoyed listening, all we ask is that you take a peek at the Patreon and consider it! We absolutely do not lament anyone who does not sign up"},{"id":"1523710783066370048","text":"We are frankly kind of stunned at the support that people have shown us so far — it's been incredibly validating. More than that, it's been motivating. We want to keep making a show everyone likes, and hopefully start making even more of it in the near future"},{"id":"1523710780990169088","text":"Last week, we launched a Patreon for our podcast. It has three tiers ($5, $7, $12), which you can see the full details of here: https://t.co/zpnrjRCH43"},{"id":"1523685244284465153","text":"I cannot get over the fact that he has the exact same facial expression no matter the activity https://t.co/kaEb0rZXNR"},{"id":"1523683656040353798","text":"dudes rock, I’m afraid"},{"id":"1523683576310501376","text":"@jonbecker_ tell that to the newest members of our “eye of the tiger” tier on Patreon"},{"id":"1523683387223199745","text":"@RmntcBaseball @Razzball if I’m being completely honest, this is one of the coolest things A-Rod has ever done. dudes rock, I must say"},{"id":"1523683238635773953","text":"tipping pitches lifting meetup in a brooklyn parking lot — who says no? https://t.co/xAHK6YeeDm"},{"id":"1523677055157940225","text":"was going to title this podcast \"The Beatings Will Continue Until We Give A-Rod More Content\" but it was too long so I tweeted it instead https://t.co/RUC36kRrJV"},{"id":"1523674527758426113","text":"We launched three new shirts at the Tipping Pitches merch store. Get them here: https://t.co/0PUycmEJus\n\nAnd of course, it would be Very Cool if you signed up for the Tipping Pitches Patreon: https://t.co/KDhFKoOR09"},{"id":"1523674258089467905","text":"There's a deep(ish) cut Taylor Swift reference and a haters' guide to Joe West's podcast in the first 15 mins of this episode. You can't afford not to listen to Tipping Pitches wherever you get podcasts! https://t.co/bgUEv8PFHh"},{"id":"1523673867423604737","text":"Mr. Commissioner, come quick! It's an emergency! My baseballs are dying at the warning track and it's causing irreparable damage to the relationship between the league, fans, and players!\n\nApple: https://t.co/k5mD91vSmv\nSpotify: https://t.co/dIkTQnyJCA"},{"id":"1523672454471688192","text":"@IamNotAble2 you see the vision!"},{"id":"1523564526934790144","text":"@angelo_sibilio you get it"},{"id":"1523543639607062529","text":"I mean, we're LOCKED in https://t.co/NFQscGHVX4 https://t.co/LmIkKx4jp8"},{"id":"1523535503324512256","text":"this tweet is a week late and sent at 1:30 am local time. that's the tipping pitches creme de la creme"},{"id":"1523535208095490049","text":"A-Rod: \"The beatings will continue until content output improves\" https://t.co/aKCm0eowRC"},{"id":"1523462108322492416","text":"this is so fucking funny. “learn fractions loser” https://t.co/gFELOPkAUZ"}],"meta":{"next_token":"7140dibdnow9c7btw421e13b718zguezdmzet7u391dti","result_count":100,"newest_id":"1526211497042509824","oldest_id":"1523462108322492416"}}